import BD_work.BD_user as bd
import random


def make_joke_for_user(tg_id : int):
    # d = {'id_tg': self.id_tg, 'name': self.name,
    #             'adult': self.adult, 'gender': self.gender}
    info = bd.check_info(tg_id)
    if info is None:
        info = {'name' : 'Какашка'}
    jokes = [
        f' Твои родители случайно не психопаты, {info['name']}?\n'
        f' Тогда в кого ты такая сладкая нестабильная дизгармонично-развитая умственноотсталая личность?',

        f" Твоя мама была самым крупным уловом в моей постели."
        f" Но твоя большая попа, {info['name']}, затмила даже её, буквально!",

        f" Представь, что я пиво, а ты, {info['name']}, сухарики к пиву! \nМы идеальный дует\n🍻"
    ]
    return '💘💝💖\n' + random.choice(jokes) +'\n🍌'